// 1. Напиши функцію, яка приймає рядок та повертає перевернутий рядок:

// function reverseString(string) {
//   const arrReverseJoin = string.split('').reverse().join('');

//   return arrReverseJoin;
// }

// console.log(reverseString('Hello World'));

// =============================================================================================================

// 2. Напиши функцію, яка приймає рядок та повертає перевернутий рядок де кожен другий символ у верхньому регістрі:

// =============================================================================================================

// 3. Напиши цикл, який виведе на консоль числа від 1 до 10.

// const numbers = 10;
// for (let i = 1; i <= numbers; i++) {
//   console.log(i);
// }

// =============================================================================================================

// 4. Напиши цикл, який виведе на консоль парні числа від 1 до 20.

// const numbers = 100;
// for (let i = 0; i <= numbers; i += 2) {
//   console.log(i);
// }

// ==============================================================================================================

// 5. Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".

// let string = 'JavaScript';
// let arrString = string.split('');
// let arr = '';

// for (let i = 1; i < arrString.length; i += 2) {
//   arr += arrString[i];
// }
// console.log(arr);

// ==============================================================================================================

// 6. Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.

// const num = 100;
// let total = 0;
// for (let i = 0; i <= num; i++) {
//   total += i;
// }
// console.log(total);

// 7. Напиши цикл, який перевірить, чи число, яке вводить користувач, є простим.
// function isPrime(num) {
//   for (let i = 2; i < num; i++) {
//     if (num % i === 0) {
//       return false;
//     } else {
//       return true;
//     }
//   }
// }
// console.log(isPrime(3));

// 8. Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до 10).
// let num = 7;
// let result = 0;
// for (let i = 1; i <= 10; i++) {
//   result = i * num;
//   console.log(`${i} * ${num} = ${result}`);
// }

// 9. Напиши цикл, який обчислить факторіал числа, введеного користувачем (наприклад, факторіал 5 = 5 _ 4 _ 3 _ 2 _ 1).

// const userNumber = 5;
// let factorial = userNumber;
// for (let i = userNumber; i > 1; i--) {
//   // console.log(i);
//   factorial *= i - 1;
//   console.log(factorial);
// }

// 10. Напиши цикл, який виведе на консоль всі прості числа від 1 до 50.

// 11. Напиши цикл, який знайде найбільший спільний дільник (НСД) двох чисел, введених користувачем.
